Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/attendance_and_discipline_in_schools/home_school_liaison.html.txt.tmx
Source language: en
Languages: ga

source: Home School Community Liaison Scheme
ga: An Scéim Caidrimh Baile- Scoile

source: The Home School Community Liaison Scheme was established in 1990
ga: Bunaíodh an Scéim Caidrimh Baile/Scoile/Pobail sa bhliain 1990

source: Teachers were initially appointed as liaison officers in a number of primary schools throughout the State in areas of urban disadvantage
ga: Ceapadh múinteoirí i roinnt bunscoileanna i gceantair chathrach a bhí faoi mhíbhuntáiste chun a bheith ina n-oifigigh chaidrimh

source: In 1991 the scheme was extended to post-primary schools
ga: I 1990 leathnaíodh an scéim ar iarbhunscoileanna agus i 1999 bhí an scéim leathnaithe ar gach scoil atá ceaptha faoi mhíbhuntáiste

source: You can find information about the Home School Community Liaison Scheme on the Department of Education and Skills website
ga: Is féidir leat eolas a fháil faoin Scéim Caidrimh Baile/Scoile/Pobail ar an Roinn Oideachais agus Scileanna láithreán gréasáin

source: The Home School Community Liaison is managed by the Child and Family Agency
ga: Tá Teagmháil Baile, Scoile agus an Phobail á bainistiú ag an An Ghníomhaireacht um Leanaí agus an Teaghlach

source: The aims of the liaison scheme are:
ga: Siad na haidhmeanna atá leis an scéim caidrimh ná:

source: • To maximise the participation of the children in the learning process, in particular those who might be at risk of failure
ga: • Go mbeadh níos mó rannpháirtíochta ag páistí sa phroiséas foghlama, go háirithe na páistí siúd atá i gcontúirt teipeadh

source: • To promote active co-operation between home, school and relevant community agencies in promoting the educational interests of the children
ga: • Comhoibriú gníomhach a chothú idir an baile, an scoil agus na heagraíochtaí pobail ábhartha, chun cúrsaí oideachais na bpáistí a chur chun cinn

source: • To raise awareness in parents of their own capacities to enhance their children's educational progress and to assist them in developing relevant skills
ga: • A mheabhrú do thuismitheoirí go bhfuil sé de chumas iontu féin cur le dul chun cinn oideachasúil a bpáistí agus cuidiú leo na scileanna cuí a fhorbairt

source: • To enhance the children's uptake from education, their retention in the educational system, their continuation to post-compulsory education and to third level and their attitudes to life-long learning
ga: • Cur leis an tairbhe a bhaineann páistí as an oideachas agus leis an tréimhse a chaitheann siad sa chóras oideachais, cur leis an seans go leanfaidh siad ar aghaidh leis an oideachas nuair nach mbíonn sé eigéanntach agus go rachaidh siad ar aghaidh chuig an triú leibhéal agus meon dearfach a chothú iontu maidir le oideachas ar feadh a saoil

source: • To disseminate the positive outcomes of the scheme throughout the school system generally
ga: • Go scaipfí na torthaí deimhneacha a bhíonn ar an scéim, tríd an gcóras scoile i gcoitinne

source: The scheme is targeted at students who are at risk of not reaching their potential in the educational system because of economic or social disadvantage
ga: Tá an scéim ag díriú ar scoláirí a bhfuil an chontúirt ann nach ndéanfaidh siad dul chun cinn d’réir a gcumais sa chóras oideachais de bhárr míbhuntáistí eacnamaíochta nó shóisialta

source: A National Co-ordinator and Assistant National Co-ordinators advise on and support the development of the scheme, liaise with participants at local level and provide a link between local and national levels
ga: Tá Comhordaitheoir Náisiúnta agus Comhordaitheoir cúnta ann le comhairle agus tacaíocht a thabhairt ar fhorbairt na scéime, chun ceangal a dhéanamh leis na rann-pháirtithe go háitiúil agus nasc a cothú idir an obair ag leibhéal aitiúil agus ag leibhéal náisiúnta

source: The home school liaison co-ordinator has access to specific funding and this is provided by the Department of Education and Skills
ga: Bíonn fáil ag múinteoir caidrimh Baile-Scoile ar chiste airgid ar leith atá solártha ag an Roinn Oideachais agus Scileanna
